{
    "nav": {
        "about": "Իմ մասին",
        "skills": "Հմտություններ",
        "portfolio": "Պորտֆոլիո",
        "contacts": "ՀԵՏԱԴԱՐՁ ԿԱՊ"
    },
    "welcome": {
        "greetings": "Բարև, ես",
        "name": "Ռոման Բաբայան եմ",
        "specialty": "Full stack Ծրագրավորող"
    },
    "profession": {
        "title": "FULL-STACK ԻՆԺԵՆԵՐ",
        "subtitle": "Full Stack ծրագրավորող եմ․ ստեղծում եմ կայքեր և հավելվածներ, որոնք գեղեցիկ են, արագ աշխատող, վստահելի և ճշգրիտ տվյալների մշակմամբ: Կարողանում եմ աշխատել ինչպես արտաքին ինտերֆեյսի, այնպես էլ սերվերային տրամաբանության հետ, իսկ անհրաժեշտության դեպքում նախագծում եմ ինտերֆեյսներ Figma-ում։",
        "moreInfo": "Frontend-ում օգտագործում եմ React և Vue TypeScript-ով, որպեսզի կոդը ճշգրիտ և հուսալի լինի, իսկ ծրագրերը աշխատեն առանց սխալների։ Tailwind և Shadcn UI-ն օգնում են ստեղծել ադապտիվ և ժամանակակից դիզայն, որը նույնքան հարմար է օգտագործել ցանկացած սարքի վրա։ Բեքենդում աշխատում եմ PHP և Laravel ծրագրային լեզուներով՝ ստեղծելով համակարգեր օգտատերերի գրանցմամբ և նույնականացմամբ Sanctum token-ներով, տվյալների մշակումով և կոնտենտի կառավարմամբ։ Կարգավորում եմ cache-ը և հերթերը կայքի արագ և անվտանգ աշխատանքի համար, ինտեգրում եմ արտաքին ծառայություններ API-ներով։ Բացի դրանից, օպտիմալացնում եմ ինտերֆեյսները, իրականացնում եմ դծրագրի տեղադրում սերվերի վրա, հետևում կայքի կայունությանը և արտադրողականությանը։ Օգտագործում եմ AI-գործիքներ՝ զարգացման գործընթացը արագացնելու, կոդը բարելավելու և ռուտինային առաջադրանքները ավտոմատացնելու համար։ Իմ նախագծերի շարքում կան բազմաթիվ փոքր և միջին ծրագրեր (որոնք կարելի է գտնել GitHub-ում), ինչպես նաև խոշոր նախագծեր, ինչպիսիք են երաժշտական պլատֆորմը և վարչական պանելը, որոնք ցույց են տալիս, թե ինչպես ինտերֆեյսը և ֆունկցիոնալությունը կարող են արդյունավետ աշխատել միասին։",
        "buttonOpen": "Ավելին",
        "buttonClose": "Փակել"
    },
    "aboutMe": {
        "title": "ԻՄ ՄԱՍԻՆ",
        "subtitle": "Ավելի քան երկու տարի զբաղվում եմ վեբ ծրագրավորմամբ։ Սկսել եմ frontend-ից՝ ստեղծելով հարմար ինտերֆեյսներ, այնուհետև ընդլայնել եմ իմ հմտությունները backend ուղղությամբ՝ ապահովելով կայքերի լիարժեք աշխատանքը և մասշտաբավորվող կառուցվածքը։ Սիրում եմ ստեղծել նախագծեր, որոնք իրականում հարմար են օգտատերերի համար։ Մշտապես սովորում եմ նոր տեխնոլոգիաներ, որպեսզի կոդը լինի որակյալ, անվտանգ և ժամանակակից",
        "frontend": "Ստեղծում եմ արագ ու հուսալի ինտերֆեյսներ React, Vue և TypeScript օգտագործելով, կատարում եմ ադապտիվ ժամանակակից դիզայն՝ մոբայլ ինտերֆեյսների համար, Tailwind և Shadcn UI-ով, օպտիմալացնում եմ արագությունն ու հարմարությունը ցանկացած սարքի վրա, միացնում արտաքին ծառայություններ API-ներով",
        "backend": "Աշխատում եմ PHP և Laravel տեխնոլոգիաներով՝ ստեղծելով համակարգեր օգտատերերի գրանցմամբ և Sanctum token-ներով օգտատերերի նույնականացում, տվյալների մշակումով և կոնտենտի կառավարմամբ։ Կարգավորում եմ cache-ը և հերթերը կայքի արագ ու անվտանգ աշխատանքի համար",
        "otherSkills": "Տիրապետում եմ Figma-ում պատրաստված UX/UI maquett-ներով աշխատելուն և ապահովելո՛ւն pixel-perfect արդյունք։ Կատարում եմ կայքերի deployment սերվերների վրա, ինտեգրում եմ API-ներ և վերահսկում հավելվածների կայունությունն ու արտադրողականությունը։ Բացի դրանից՝ օգտագործում եմ AI գործիքներ՝ գործընթացները արագացնելու, կոդը բարելավելու և ռուտին գործողությունները ավտոմատացնելու համար"
    },
    "skills": {
        "title": "ՀՄՏՈՒԹՅՈՒՆՆԵՐ",
        "subtitle": "ՕԳՏԱԳՈՐԾՈՒՄ ԵՄ",
        "otherSkills": "ԼԵԶՈՒՆԵՐԻ ՀՄՏՈՒԹՅՈՒՆՆԵՐ",
        "en": "Անգլերեն",
        "ru": "Ռուսերեն",
        "am": "Հայերեն",
        "buttonOpen": "Ավելին",
        "buttonClose": "Փակել"
    },
    "portfolio": {
        "title": "ՊՈՐՏՖՈԼԻՈ",
        "all": "Բոլորը",
        "bottom": "Եվ սա դեռ սկիզբն է!"
    },
    "contact": {
        "title": "ՀԵՏԱԴԱՐՁ ԿԱՊ",
        "subtitle": "Համագործակցության, կայքերի ստեղծման կամ նախագծերի վերաբերյալ հարցերի համար կարող եք գրել ֆորմայի միջոցով։",
        "name": "ՄՈՒՏՔԱԳՐԵՔ ՁԵՐ ԱՆՈՒՆԸ",
        "nameError1": "Մուտքագրեք անունը",
        "nameError2": "Անունը պետք է պարունակի ոչ ավելի քան 50 նշան",
        "email": "ՄՈՒՏՔԱԳՐԵՔ ՁԵՐ ԷԼ. ՀԱՍՑԵՆ",
        "emailError1": "Մուտքագրեք վավեր էլ. հասցե",
        "emailError2": "ԷԼ. հասցեն պետք է պարունակի ոչ ավելի քան 50 նշան",
        "phone": "ՀԵՌԱԽՈՍԱՀԱՄԱՐ",
        "phoneError1": "Հեռախոսահամարը պետք է պարունակի առնվազն 3 թիվ",
        "phoneError2": "Թույլատրվում են միայն թվեր և + նշան",
        "phoneError3": "Հեռախոսահամարը չի կարող պարունակել 20-ից ավելի թիվ",
        "message": "ՁԵՐ ՀԱՂՈՐԴԱԳՐՈՒԹՅՈՒՆԸ",
        "messageError1": "Մուտքագրեք հաղորդագրություն",
        "messageError2": "Առավելագույնը 250 նիշ",
        "formErrorMessage": "Ինչ-որ բան սխալ է տեղի ունեցել, կարող եք ինձ գրել էլեկտրոնային փոստով:",
        "messageSended": "Հաղորդագրությունը ուղարկված է!",
        "button": "ՈւՂԱՐԿԵԼ"
    },
    "footer": {
        "button": "ՎԵՐԵՎ",
        "rights": "Բոլոր իրավունքները պաշտպանված են։"
    }
}
