{
    "nav": {
        "about": "Обо мне",
        "skills": "Навыки",
        "portfolio": "Портфолио",
        "contacts": "СВЯЗАТЬСЯ"
    },
    "welcome": {
        "greetings": "Привет, я",
        "name": "Роман Бабаян",
        "specialty": "Full stack Разработчик"
    },
    "profession": {
        "title": "FULL-STACK ИНЖЕНЕР",
        "subtitle": "Я Full Stack разработчик: создаю сайты и приложения, которые красиво выглядят, быстро работают и надежно обрабатывают данные. Могу работать и с внешним интерфейсом, и с внутренней логикой сайта, а также делать дизайн интерфейсов в Figma.",
        "moreInfo": "На фронтенде использую React и Vue с TypeScript, чтобы код был точным и надежным, а приложения работали без ошибок. Tailwind и Shadcn UI помогают создавать адаптивный и современный дизайн, который одинаково удобно использовать на любом устройстве.На бэкенде работаю с PHP и Laravel: создаю системы с регистрацией и авторизацией пользователей через токены Sanctum, обработкой данных и управлением контентом. Настраиваю кеширование и очереди для быстрой и безопасной работы сайта, интегрирую внешние сервисы через API.Кроме этого, оптимизирую интерфейсы, делаю деплой на сервер, слежу за стабильностью и производительностью. Использую AI-инструменты, чтобы ускорять разработку, улучшать код и автоматизировать рутинные задачи. Среди моих проектов — множество небольших и средних приложений (которые можно найти на GitHub), а также крупные проекты, такие как музыкальная платформа и административная панель, демонстрирующие, как интерфейс и функциональность могут работать вместе эффективно.",
        "buttonOpen": "Подробнее",
        "buttonClose": "Свернуть"
    },
    "aboutMe": {
        "title": "ОБО МНЕ",
        "subtitle": "Я занимаюсь веб-разработкой более двух лет. Начал с фронтенда, создавая удобные интерфейсы, потом расширил навыки на бэкенд, чтобы сайты были полностью рабочими и масштабируемыми. Люблю разрабатывать проекты, которые удобны для пользователей. Постоянно учусь новым технологиям, чтобы код был качественным, безопасным и современным",
        "frontend": "Создаю быстрые и надежные интерфейсы с React, Vue и TypeScript, делаю адаптивный современный дизайн на Tailwind и Shadcn UI, оптимизирую скорость и удобство на любых устройствах, подключаю внешние сервисы через API",
        "backend": "Работаю с PHP и Laravel, создаю системы с регистрацией и авторизацией пользователей через токены Sanctum, обработкой данных и управлением контентом. Настраиваю кеширование и очереди для безопасной и быстрой работы сайта",
        "otherSkills": "Умею работать по готовым UX/UI макетам и точно реализовывать верстку (pixel perfect) на основе дизайна в Figma. Делать деплой сайтов на сервер, интегрировать API, следить за стабильностью и производительностью приложений. Также использую AI-инструменты, чтобы ускорять работу, улучшать код и автоматизировать рутинные задачи."
    },
    "skills": {
        "title": "НАВЫКИ",
        "subtitle": "ИСПОЛЬЗУЮ СЕЙЧАС",
        "otherSkills": "ЯЗЫКОВЫЕ НАВЫКИ",
        "en": "Английский",
        "ru": "Русский",
        "am": "Армянский",
        "buttonOpen": "Подробнее",
        "buttonClose": "Закрыть"
    },
    "portfolio": {
        "title": "ПОРТФОЛИО",
        "all": "Все",
        "bottom": "И это только начало!"
    },
    "contact": {
        "title": "КОНТАКТЫ",
        "subtitle": "По вопросам сотрудничества, разработки сайтов или проектов можете написать по форме.",
        "name": "ВВЕДИТЕ ВАШE ИМЯ",
        "nameError1": "Введите имя",
        "nameError2": "Имя должно содержать не более 50 символов",
        "email": "ВВЕДИТЕ ВАШ EMAIL",
        "emailError1": "Введите корректный email",
        "emailError2": "Email должен содержать не более 50 символов",
        "phone": "НОМЕР ТЕЛЕФОНА",
        "phoneError1": "Телефон должен содержать минимум 3 цифры",
        "phoneError2": "Допускаются только цифры и знак +",
        "phoneError3": "Телефон не должен содержать больше 20 цифр",
        "message": "ВАШЕ СООБЩЕНИЕ",
        "messageError1": "Напишите сообщение",
        "messageError2": "Максимум 250 символов",
        "formErrorMessage": "Что-то пошло не так, вы можете написать мне на почту.",
        "messageSended": "Сообщение отправлено!",
        "button": "ОТПРАВИТЬ"
    },
    "footer": {
        "button": "НАВЕРХ",
        "rights": "Все права защищены."
    }
}
